In [118]:
import pandas as pd

In [119]:
names_1 = pd.read_csv('muslim_names/arabic_names.csv')

In [120]:
names_1.head()

,english_name,arabic_name,gender,origin
0,Aali,عالي,m,Arabic
1,Aaliyah,عالية,f,"Arabic, English (Modern), African American (Mo..."
2,Aamina,آمنة,f,"Arabic, Eastern African, Somali"
3,Aaminah,آمنة,f,Arabic
4,'Aamir,عامر,m,Arabic

In [121]:
names_1.drop(['arabic_name', 'origin', 'gender'] , axis=1, inplace=True)

In [122]:
names_1.head()

  english_name
0         Aali
1      Aaliyah
2       Aamina
3      Aaminah
4       'Aamir

In [123]:
names_1 = names_1.rename(columns={'english_name':'Name'})

In [124]:
names_1.head()

      Name
0     Aali
1  Aaliyah
2   Aamina
3  Aaminah
4   'Aamir

In [125]:
names_2 = pd.read_csv('muslim_names/arabnames.csv')
names_3 = pd.read_csv('muslim_names/females_en.csv')
names_4 = pd.read_csv('muslim_names/males_en.csv')
names_2.drop(['Gender'], axis=1, inplace=True)
names_3.drop(['Gender'], axis=1, inplace=True)
names_4.drop(['Gender'], axis=1, inplace=True)

In [126]:
names_2.head()

    Name
0  aaban
1  aabid
2  aadil
3  aahil
4  aalam

In [127]:
names_3.head()

      Name
0  aabidah
1  aabirah
2   aabish
3    aadab
4   aadila

In [128]:
names_4.tail()

            Name
2061    zulfaqar
2062    zulfiqar
2063  zulqarnain
2064     zunnoon
2065        zuti

In [129]:
aggregated_names = pd.concat([names_2, names_3], ignore_index=True)

In [130]:
aggregated_names

          Name
0        aaban
1        aabid
2        aadil
3        aahil
4        aalam
...        ...
6951  zumurrud
6952    zumzum
6953  zunairah
6954     zynah
6955      zyva

[6956 rows x 1 columns]

In [131]:
aggregated_names = pd.concat([aggregated_names, names_4], ignore_index=True)

In [132]:
aggregated_names

            Name
0          aaban
1          aabid
2          aadil
3          aahil
4          aalam
...          ...
9017    zulfaqar
9018    zulfiqar
9019  zulqarnain
9020     zunnoon
9021        zuti

[9022 rows x 1 columns]

In [133]:
aggregated_names = pd.concat([aggregated_names, names_1], ignore_index=True)

In [134]:
aggregated_names

             Name
0           aaban
1           aabid
2           aadil
3           aahil
4           aalam
...           ...
10213        Guda
10214      Haamid
10215       Habib
10216      Habiba
10217  Habibullah

[10218 rows x 1 columns]

In [135]:
print(aggregated_names.duplicated().sum())

5488

In [136]:
final_df = aggregated_names.drop_duplicates()

In [137]:
print(aggregated_names.duplicated().sum())

5488

In [138]:
print(aggregated_names.isnull().sum())

Name    0
dtype: int64

In [142]:
aggregated_names.head()

    Name
0  aaban
1  aabid
2  aadil
3  aahil
4  aalam

In [143]:
aggregated_names.to_csv("aggregated_muslim_names.csv")

In [144]:
df = pd.read_csv("aggregated_muslim_names.csv")

In [148]:
df

       Unnamed: 0        Name
0               0       aaban
1               1       aabid
2               2       aadil
3               3       aahil
4               4       aalam
...           ...         ...
10213       10213        Guda
10214       10214      Haamid
10215       10215       Habib
10216       10216      Habiba
10217       10217  Habibullah

[10218 rows x 2 columns]

In [151]:
df.drop_duplicates(subset='Name', keep='first', inplace=True)

In [152]:
df

      Unnamed: 0        Name
0              0       aaban
1              1       aabid
2              2       aadil
3              3       aahil
4              4       aalam
...          ...         ...
9316        9316        Guda
9317        9317      Haamid
9318        9318       Habib
9319        9319      Habiba
9320        9320  Habibullah

[4730 rows x 2 columns]

In [154]:
print(df.duplicated().sum())

0

In [155]:
print(df.isnull().sum())

Unnamed: 0    0
Name          0
dtype: int64

In [156]:
df.to_csv("muslim_names.csv")